#Напишите программу, которая выводит нечетные числа из заданного списка
#и останавливается, если встречает число 554.

#lst=[554, 2, 67, 789, 554, 34, 57]
#for i in lst:
 #   if i %2 != 0:
  #      print(i)
   # if i == 554:
    #    break



#import random

#lst=[554]




#for i in range(random.randint(5,15)): # сколько чисел в списке
#    x = random.randint(500,600)
 #   lst.append(x) # добавляем переменную в конец списка

#print(lst)
#random.shuffle(lst)  # перемешали список
#print(lst)

#for i in lst:
 #   if i %2 != 0:
  #      print(i)
  #  if i == 554:
#break

#Сложить числа вещественного числа

#number = '5.679'
#sum = 0
#for i in number:
#    if i != '.':
#        sum += int(i)
#print(sum)


#Посчитайте, сколько раз символ встречается в строке

# Посчитайте, сколько раз символ встречается в строке
stroka = ('Посчитайте, сколько раз символ встречается в строке')
simvol = 'а'
final = 0
for i in stroka:
    if simvol == i:
        final +=1
print(final)

#https://pythonworld.ru/tipy-dannyx-v-python/slovari-dict-funkcii-i-metody-slovarej.html
